In [2]:
import pandas as pd
df = pd.read_excel('member.xlsx', index_col='번호')
df

     이름  출생연도 출생지  담당파트  체중
번호
1번    진  1992  과천  서브보컬  61
2번    뷔  1995  대구  서브보컬  63
3번   정국  1997  부산  메인보컬  66
4번   슈가  1993  대구  리드래퍼  57
5번  제이홉  1994  광주  메인댄서  59
6번   RM  1994  서울    리더  70
7번   지민  1995  부산  메인댄서  58

In [2]:
# 계산 가능한 데이터에 대해 컬럼별로 개수, 평균, 최소, 최대 등을 요약
df.describe()

              출생연도         체중
count     7.000000   7.000000
mean   1994.285714  62.000000
std       1.603567   4.690416
min    1992.000000  57.000000
25%    1993.500000  58.500000
50%    1994.000000  61.000000
75%    1995.000000  64.500000
max    1997.000000  70.000000

In [3]:
df.info() # 데이터 프레임 요약된 정보

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 1번 to 7번
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   출생연도    7 non-null      int64
 2   출생지     7 non-null      object
 3   담당파트    7 non-null      object
 4   체중      7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

In [3]:
# 처음 5개의 row 가져오기
df.head(4)

    이름  출생연도 출생지  담당파트  체중
번호
1번   진  1992  과천  서브보컬  61
2번   뷔  1995  대구  서브보컬  63
3번  정국  1997  부산  메인보컬  66
4번  슈가  1993  대구  리드래퍼  57

In [5]:
# 마지막 5개 row를 가져오기
df.tail()

     이름  출생연도 출생지  담당파트  체중
번호
3번   정국  1997  부산  메인보컬  66
4번   슈가  1993  대구  리드래퍼  57
5번  제이홉  1994  광주  메인댄서  59
6번   RM  1994  서울    리더  70
7번   지민  1995  부산  메인댄서  58

In [6]:
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번', '7번'], dtype='object', name='번호')

In [7]:
df.columns

Index(['이름', '출생연도', '출생지', '담당파트', '체중'], dtype='object')

In [8]:
df.shape # row, column 개수

(7, 5)

In [11]:
df['체중'] # column 확인

번호
1번    61
2번    63
3번    66
4번    57
5번    59
6번    70
7번    58
Name: 체중, dtype: int64

In [12]:
df['체중'].describe()

count     7.000000
mean     62.000000
std       4.690416
min      57.000000
25%      58.500000
50%      61.000000
75%      64.500000
max      70.000000
Name: 체중, dtype: float64

In [13]:
df['체중'].max()

70

In [14]:
df['체중'].min()

57

In [15]:
df['체중'].sum()

434

In [16]:
df['체중'].nlargest(3) # 체중이 큰 순서로 3개

번호
6번    70
3번    66
2번    63
Name: 체중, dtype: int64

In [18]:
df['출생지'].unique()

array(['과천', '대구', '부산', '광주', '서울'], dtype=object)

In [19]:
df['출생지'].nunique()

5

In [22]:
# Q) 체중이 작은 순서대로 3명
df['체중'].nsmallest(3).index

Index(['4번', '7번', '5번'], dtype='object', name='번호')

In [23]:
# Q) 담당파트의 종류는?
df['담당파트'].unique()

array(['서브보컬', '메인보컬', '리드래퍼', '메인댄서', '리더'], dtype=object)